{"version":"https://jsonfeed.org/version/1.1","title":"@CIOPortfolio","home_page_url":"https://cioportfolio.github.io/","feed_url":"https://cioportfolio.github.io/full.json","description":"Blog","user_comment":"@CIOPortfolio JSON feed (full articles)","authors":[{"name":"Richard Barton","url":"https://www.cioportfolio.co.uk/"}],"language":"en","icon":"https://cioportfolio.github.io/icon-192.png","favicon":"https://cioportfolio.github.io/icon-512.png","items":[{"id":"https://cioportfolio.github.io/2021/02/we-need-to-talk-about-tom/","url":"https://cioportfolio.github.io/2021/02/we-need-to-talk-about-tom/","title":"We need to talk about TOM","date_published":"2021-02-22T00:00:00Z","language":"","content_html":"&lt;p&gt;Most people go their whole lives without encountering a Target Operating Model (TOM). If you are one of the unlucky few who have to work on a TOM this post provides some hints and tips. I hope it will help you survive the experience and even get something useful out of it. Enormous amounts of money and energy go into TOMs so we should get more value out than we put in.&lt;/p&gt;&lt;blockquote class=&quot;notice&quot;&gt;&lt;h4 id=&quot;help-me-improve-this-post&quot;&gt;Help me improve this post&lt;/h4&gt;&lt;p&gt;This post was inspired by some discussions at UKGovCamp&lt;sup class=&quot;footnote-ref&quot;&gt;&lt;a href=&quot;https://cioportfolio.github.io/2021/02/we-need-to-talk-about-tom/#fn1&quot; id=&quot;fnref1&quot;&gt;[1]&lt;/a&gt;&lt;/sup&gt;. I’m hoping others who know more about this topic or are more engaging writers will help me iterate this or create something better.&lt;/p&gt;&lt;/blockquote&gt;&lt;h2 id=&quot;what-is-a-target-operating-model&quot;&gt;What is a Target Operating Model?&lt;/h2&gt;&lt;p&gt;There are several formal definitions of a Target Operating Model&lt;sup class=&quot;footnote-ref&quot;&gt;&lt;a href=&quot;https://cioportfolio.github.io/2021/02/we-need-to-talk-about-tom/#fn2&quot; id=&quot;fnref2&quot;&gt;[2]&lt;/a&gt;&lt;/sup&gt; but they often only make sense to specialists in the field. For this post, let’s use an analogy that might be easier to understand.&lt;/p&gt;&lt;p&gt;If you are moving house you can visit an estate agent to get pictures and descriptions of your new home. You will get precise information about some things, such as the layout and size of the rooms, but other important things won’t appear at all. For example, sounds and smells will have a big impact on how much you enjoy your new home but don’t expect to find out anything about these from the property details.&lt;/p&gt;&lt;p&gt;In a similar way, if you want to change your organisation and move to a new way of working you can look at a TOM to find pictures and descriptions of how things will be in the future. A TOM won’t normally include details of floor plans and rooms but you will see things like organisation hierarchy charts, budget spreadsheets and process flow diagrams&lt;sup class=&quot;footnote-ref&quot;&gt;&lt;a href=&quot;https://cioportfolio.github.io/2021/02/we-need-to-talk-about-tom/#fn3&quot; id=&quot;fnref3&quot;&gt;[3]&lt;/a&gt;&lt;/sup&gt;. Just as for property details, the TOM won’t include some important aspects such as: Will the the training be any good? Will your colleagues enjoy the new ways of working?&lt;/p&gt;&lt;h2 id=&quot;what-are-the-limitations-of-a-tom&quot;&gt;What are the limitations of a TOM?&lt;/h2&gt;&lt;p&gt;Before committing to moving you would be wise to go and visit your new house. The estate agent pictures and descriptions can only give you a vague idea of what your home will be like. Even though you have studied the dimensions of the rooms, you might be surprised about how it feels when you actually visit and move around the space.&lt;/p&gt;&lt;p&gt;Unfortunately, there are loads of things you just can’t know until after you have moved. What is the best place for all your existing furniture? How will you get on with the neighbours? What is it like when the weather is particularly warm or cold?&lt;/p&gt;&lt;p&gt;Just as the description of a house cannot capture what it is like to live there, a TOM cannot capture what it will be like to work in the future organisation. Worse, you won’t have the option to visit. The future organisation described in the TOM hasn’t been built yet and there isn’t anything resembling a show-home. You can’t even visit the neighbourhood and ask people what it is like to live in the area.&lt;/p&gt;&lt;h2 id=&quot;why-are-toms-useful&quot;&gt;Why are TOMs useful?&lt;/h2&gt;&lt;p&gt;The details of a property have a lot of limitations but they are still useful, because there are thousands of properties available but only a few are worth considering. The details from the agent are good enough to create a short-list of properties to visit before making a decision.&lt;/p&gt;&lt;p&gt;TOMs are useful in the same way. There are infinite different ways you might structure and run your organisation; a TOM can help you find a manageable set of options to explore further.&lt;/p&gt;&lt;h2 id=&quot;why-do-toms-go-wrong&quot;&gt;Why do TOMs go wrong?&lt;/h2&gt;&lt;p&gt;One of the biggest problems with TOMs is a lack of experience. Few of the people involved in an organisation change will work on the TOM. Fewer still will work on more than one TOM. Perhaps no one has worked on a TOM in similar circumstances. Firms of management consultants will have created many TOMs but most of the consultants assigned to work with you will be on their first or second TOM project. Even their team leaders might not have seen their previous TOMs through to implementation. Very few people can reliably claim to know what works and what doesn’t.&lt;/p&gt;&lt;p&gt;Lack of experience is compounded by excessive optimism. Despite all the limitations, people working on a TOM can be remarkably confident in the predictive power of the pictures and descriptions. People can remain confident even when previous organisation changes have run into issues and have not lived up to the descriptions in the TOM. Teams working on a TOM often encourage each other that everything will work out better this time.&lt;/p&gt;&lt;p&gt;The result is that people attach more significance to the TOM than it deserves. After some senior management scrutiny, considerable amounts of time and money are committed to implementing it. The implementation often starts with a gap analysis and detailed plan. This seems quite a logical process but it actually compounds the problem. Like the TOM itself, gap analysis and up front planning can be useful but they often consume more time and effort than they deserve. Returning to our house analogy, this is like planning the house-warming party before the builder has started to dig the foundations. What could possibly go wrong?&lt;/p&gt;&lt;p&gt;After all this work has been done we still know very little about what the future organisation will really be like. We have also used up a lot of time and money that could have been put to better use.&lt;/p&gt;&lt;h2 id=&quot;is-there-a-better-way&quot;&gt;Is there a better way?&lt;/h2&gt;&lt;p&gt;Here are some suggestions to use TOMs to your advantage.&lt;/p&gt;&lt;h3 id=&quot;be-constructive&quot;&gt;Be constructive&lt;/h3&gt;&lt;p&gt;Some people argue that the whole idea of TOMs is flawed&lt;sup class=&quot;footnote-ref&quot;&gt;&lt;a href=&quot;https://cioportfolio.github.io/2021/02/we-need-to-talk-about-tom/#fn4&quot; id=&quot;fnref4&quot;&gt;[4]&lt;/a&gt;&lt;/sup&gt; and in many ways they are right.&lt;/p&gt;&lt;blockquote&gt;&lt;p&gt;&lt;strong&gt;“All models are wrong but some are useful.”&lt;/strong&gt;&lt;sup class=&quot;footnote-ref&quot;&gt;&lt;a href=&quot;https://cioportfolio.github.io/2021/02/we-need-to-talk-about-tom/#fn5&quot; id=&quot;fnref5&quot;&gt;[5]&lt;/a&gt;&lt;/sup&gt;&lt;/p&gt;&lt;/blockquote&gt;&lt;p&gt;Like other kinds of model, TOMs are a great idea as long as they are not used in isolation and are not taken to extremes. Getting involved in working on a TOM does not need to be a source of despair. Be constructive and work with your colleagues to steer your TOM efforts onto a productive path.&lt;/p&gt;&lt;h3 id=&quot;find-relevant-stories-and-analogies&quot;&gt;Find relevant stories and analogies&lt;/h3&gt;&lt;p&gt;Many people, perhaps even those who have commissioned the TOM, will have a very mechanistic or procedural idea of how a TOM will be created and used. You will need to engage people and get their support to work on the TOM in a more flexible way. Stories and analogies can help people make sense of the change they are seeking and where the TOM fits into this.&lt;/p&gt;&lt;p&gt;In the introduction I’ve used property details as an analogy but, in my work, I’ve also used everything from board games to ocean voyages. It just depends on what works for your stakeholders. They may come up with their own analogies that you can use. I’ve worked on enough TOMs to be able to tell my own stories about how things can go well or not. Don’t be afraid to use stories you gather from your colleagues, contacts and communities. If you are totally stuck, get in touch and I will share mine.&lt;/p&gt;&lt;h3 id=&quot;start-with-user-needs&quot;&gt;Start with user needs&lt;/h3&gt;&lt;p&gt;If you are working on a digital product or service it isn’t good practice to develop all the potential features in one go. Instead, your team will conduct research and use prototypes to get evidence that the most important features will deliver the results you need. This way of thinking works well for a TOM too.&lt;/p&gt;&lt;p&gt;First, think of the TOM as your product. Consider:&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Who is expecting to use the TOM?&lt;/li&gt;&lt;li&gt;What do they think it will achieve?&lt;/li&gt;&lt;li&gt;Which chapters or sections of the TOM are most relevant to their needs?&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;You can use this insight to create quick prototypes or rough drafts of parts of the TOM, get early feedback and then iterate.&lt;/p&gt;&lt;p&gt;You will be working on a TOM because your organisation is considering making some big changes. Think of these changes as a product or service and repeat the steps you have applied to your TOM.&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Who needs the organisation to change?&lt;/li&gt;&lt;li&gt;What do they expect to achieve by changing?&lt;/li&gt;&lt;li&gt;What practical steps can you take to achieve those results or get a better understanding of them?&lt;/li&gt;&lt;/ul&gt;&lt;h3 id=&quot;follow-the-needs-wherever-they-lead&quot;&gt;Follow the needs wherever they lead&lt;/h3&gt;&lt;p&gt;Starting with user needs can produce quite surprising results. Accept them and use your new insight to shape the next steps. Here are some examples:&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;strong&gt;You can develop a small part of the TOM and stop.&lt;/strong&gt; This might be detailed work on just a few of the sections in your TOM or an imprecise outline of the whole thing. This can happen when the TOM is being developed to feed into a business case for a major change. It can also help to make decisions about the next stage of a much larger change programme.&lt;/li&gt;&lt;li&gt;&lt;strong&gt;The scope of the TOM is too narrow.&lt;/strong&gt; This can happen when the most important parameters of the new organisation depend on external factors. For example, your TOM might need to change depending upon demand from direct users or their end-customers. You will need a model of your wider environment. You may also need to conduct experiments to help you understand the demand and how different ways of operating might affect it. With a wider scope it will be even more important to take an iterative approach with lots of feedback.&lt;/li&gt;&lt;li&gt;&lt;strong&gt;A TOM can’t solve the most important problems.&lt;/strong&gt; This is common when people need assurance about what will work in practice. A conceptual document can’t tell you anything about this. Instead, you will need to shift to experiments or, at the very least, simulations. A TOM might be a good way to record what you learn from your experiments.&lt;/li&gt;&lt;li&gt;&lt;strong&gt;You can’t find anyone who is going to use the TOM!&lt;/strong&gt; Executives may have been told, or assume, that it is important for their teams and their teams have been told, or assume, that it is required by the executives. If you find yourself in this situation there are probably more fundamental issues to resolve. Better to put your energy into solving those and not waste time on a TOM. Perhaps a TOM will have a role to play later.&lt;/li&gt;&lt;/ul&gt;&lt;h3 id=&quot;look-after-yourself-take-a-breath-and-try-again&quot;&gt;Look after yourself, take a breath and try again&lt;/h3&gt;&lt;p&gt;If you are working on a TOM then you may well be working in a large team. You might come across powerful and passionate people with their own ideas about the role of a TOM, its contents and the best way to go about it. Some of the team may have been specifically engaged to work on a TOM and could feel threatened if you question how it is done. There may be significant obstacles or objections to what you are trying to do or even to raising it as a topic of discussion.&lt;/p&gt;&lt;p&gt;Make sure you look after yourself and don’t expect to get your way every time. Conserve your energy and pick your battles. You may not be able to do everything you want but even small changes could still produce a big reduction in waste or risk for your organisation. Be happy with that and, when you’ve got the energy, try for more.&lt;/p&gt;&lt;h4 id=&quot;footnotes&quot;&gt;Footnotes:&lt;/h4&gt;&lt;hr class=&quot;footnotes-sep&quot; /&gt;&lt;section class=&quot;footnotes&quot;&gt;&lt;ol class=&quot;footnotes-list&quot;&gt;&lt;li id=&quot;fn1&quot; class=&quot;footnote-item&quot;&gt;&lt;p&gt;Find out more by visiting the &lt;a href=&quot;https://www.ukgovcamp.com/&quot;&gt;UKGovCamp website&lt;/a&gt; or checking the &lt;a href=&quot;https://twitter.com/hashtag/ukgc21&quot;&gt;#ukgc21 topic in Twitter&lt;/a&gt; &lt;a href=&quot;https://cioportfolio.github.io/2021/02/we-need-to-talk-about-tom/#fnref1&quot; class=&quot;footnote-backref&quot;&gt;↩︎&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;li id=&quot;fn2&quot; class=&quot;footnote-item&quot;&gt;&lt;p&gt;A quick web search will uncover more definitions and references about &lt;a href=&quot;https://en.wikipedia.org/wiki/Operating_model&quot;&gt;operating models&lt;/a&gt; and &lt;a href=&quot;https://en.wikipedia.org/wiki/Target_operating_model&quot;&gt;target operating models&lt;/a&gt; &lt;a href=&quot;https://cioportfolio.github.io/2021/02/we-need-to-talk-about-tom/#fnref2&quot; class=&quot;footnote-backref&quot;&gt;↩︎&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;li id=&quot;fn3&quot; class=&quot;footnote-item&quot;&gt;&lt;p&gt;The contents of a TOM are often summarised as people, process and technology but they usually need to cover goods, services, customers, suppliers and money as well. They are usually large and complex documents covering a wide range of topics. Sometimes they are a whole library of documents. &lt;a href=&quot;https://cioportfolio.github.io/2021/02/we-need-to-talk-about-tom/#fnref3&quot; class=&quot;footnote-backref&quot;&gt;↩︎&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;li id=&quot;fn4&quot; class=&quot;footnote-item&quot;&gt;&lt;p&gt;As an example, Ben Proctor has &lt;a href=&quot;https://medium.com/the-satori-lab/why-a-target-operating-model-is-killing-your-public-service-625822d96742&quot;&gt;written about the problems with TOMs&lt;/a&gt; &lt;a href=&quot;https://cioportfolio.github.io/2021/02/we-need-to-talk-about-tom/#fnref4&quot; class=&quot;footnote-backref&quot;&gt;↩︎&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;li id=&quot;fn5&quot; class=&quot;footnote-item&quot;&gt;&lt;p&gt;&lt;a href=&quot;https://www.imperial.ac.uk/business-school/news/all-models-are-wrong-some-are-useful/&quot;&gt;George Box was talking about statistics when he coined this phrase but works well in lots of other fields.&lt;/a&gt; &lt;a href=&quot;https://cioportfolio.github.io/2021/02/we-need-to-talk-about-tom/#fnref5&quot; class=&quot;footnote-backref&quot;&gt;↩︎&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ol&gt;&lt;/section&gt;"},{"id":"https://cioportfolio.github.io/2020/11/yearnote-4-november-2019-27-november-2020/","url":"https://cioportfolio.github.io/2020/11/yearnote-4-november-2019-27-november-2020/","title":"Yearnote 4 November 2019 - 27 November 2020","date_published":"2020-11-20T00:00:00Z","language":"","content_html":"&lt;p&gt;On a year in Cornwall Council.I’ve now been working at Cornwall Council for just over a year&lt;sup class=&quot;footnote-ref&quot;&gt;&lt;a href=&quot;https://cioportfolio.github.io/2020/11/yearnote-4-november-2019-27-november-2020/#fn1&quot; id=&quot;fnref1&quot;&gt;[1]&lt;/a&gt;&lt;/sup&gt; and have been regularly writing weeknotes&lt;sup class=&quot;footnote-ref&quot;&gt;&lt;a href=&quot;https://cioportfolio.github.io/2020/11/yearnote-4-november-2019-27-november-2020/#fn2&quot; id=&quot;fnref2&quot;&gt;[2]&lt;/a&gt;&lt;/sup&gt; for most of that time. It is a bonus if someone else gets something from these notes but they are mostly for me. In theory, I could do all of this reflection in a private journal but I’ve never kept them going for very long. I guess the tiny chance that someone might notice I have stopped writing them is enough to keep going. This is my first go at using the notes for some more longer-term reflection.&lt;/p&gt;&lt;h2 id=&quot;doing&quot;&gt;Doing&lt;/h2&gt;&lt;p&gt;My official job is to be the Agile Coach for Cornwall Council’s IS Department. This is a pretty rare job and you won’t find the title very often, especially in a UK local authority. However, if you look behind the title to what an Agile Coach is supposed to do&lt;sup class=&quot;footnote-ref&quot;&gt;&lt;a href=&quot;https://cioportfolio.github.io/2020/11/yearnote-4-november-2019-27-november-2020/#fn3&quot; id=&quot;fnref3&quot;&gt;[3]&lt;/a&gt;&lt;/sup&gt; you will probably recognise a lot of things that you or your colleagues are already doing. There are many other agile coaches in Cornwall Council but most don’t have it in their job title.&lt;/p&gt;&lt;p&gt;There is always a bit of pure agile coaching in my week but the proportion has varied a lot over the year. In my first few weeks it was close to 100%. Recently, it has been around 20% and occasionally lower. I am pretty happy about this. There are a lot of things that can make teams struggle and lack of agile coaching isn’t always the most important one. I wouldn’t be doing my job if I didn’t keep trying to progress our agile transformation, but I wouldn’t be a good colleague if I left others to struggle when I was able to help. This year, I’ve done everything from handling calls on our IS helpdesk to unblocking extension funding for some critical contractors. In recent weeks I’ve been covering Delivery Management and Product Management&lt;sup class=&quot;footnote-ref&quot;&gt;&lt;a href=&quot;https://cioportfolio.github.io/2020/11/yearnote-4-november-2019-27-november-2020/#fn4&quot; id=&quot;fnref4&quot;&gt;[4]&lt;/a&gt;&lt;/sup&gt; roles that we haven’t been able to fill on a permanent basis. Many of my colleagues have done way more than me including taking secondments in front line services during the peak of the COVID crisis.&lt;/p&gt;&lt;p&gt;I’m also really happy that I’ve been able to coach outside of the IS Department - including my first ever invitation to talk to an internal audit team about agile audits! We can’t develop IS services in isolation. We can’t even start work on them without talented teams so our agility in technology is constrained by our agility in managing people, money and commercial arrangements. Also, none of our IS services are very useful on their own. They are just components of the richer services the Council provides to Cornwall’s residents and visitors. The measure of our agility should be the experience of our residents and visitors, not a couple of hundred people in the IS Department.&lt;/p&gt;&lt;h2 id=&quot;admiring&quot;&gt;Admiring&lt;/h2&gt;&lt;p&gt;I really am part of a fantastic team. Yes, we have our issues, but I’ve worked in enough private sector companies to know that most other organisations have the same.&lt;/p&gt;&lt;p&gt;I was impressed by the standards of our IT services when I first joined the Council. I got my work laptop on my first day and everything just worked. I already had a pretty good mobile phone and tablet, and our bring-your-own-device service meant that I could use these securely with very little fuss. Our default security settings for work IT are very high but our Head of Cyber Security actively supported me in getting external collaboration tools unlocked so that I could continue to be an active member of several professional and public sector communities. I’ve worked with private sector and central government organisations of the same size that couldn’t match this and they had much bigger budgets.&lt;/p&gt;&lt;p&gt;As the COVID crisis took hold the team rose to the challenge. Months into the pandemic some large private sector organisations are still struggling to handle calls. Our brilliant teams had most call centre staff working effectively from home within a few days. They have followed this up with the rapid roll-out of online collaboration tools and hosting broadcast-scale events for internal staff briefings and public Council events. We’ve had our fastest ever releases of new systems (one in only 9 working days and a second, including fast track procurement, in just 15 working days) to help manage COVID outbreaks or help run our services in a COVID-safe way.&lt;/p&gt;&lt;p&gt;Some of our work does not go so smoothly but, even then, you can rely on our teams to get stuck in and sort things out. Many of the team have worked evenings and weekends to put things right. We probably need to do more to make sure this sort of burden is shared fairly around the team but, otherwise, I am not sure what more I could expect.&lt;/p&gt;&lt;h2 id=&quot;learning&quot;&gt;Learning&lt;/h2&gt;&lt;p&gt;I could probably fill a book with the things I have learnt in my first year at the Council. A few things have stood out for me while going back over my weeknotes.&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Most people starting out with agile practices see them as a set of rules or procedures. After a while they start to realise it is a way of thinking: a way of focusing on what is most important and continuously getting better at it. I’ve been learning to look out for people and teams that have already evolved some great ways of working, and build on that rather than promote my own favourite tools and techniques.&lt;/li&gt;&lt;li&gt;I’m learning to be patient when guiding teams to be more independent and, ultimately, self-managing. People who have had very little influence over their work develop habits and routines that are not easy to let go. It takes time to build the confidence and trust needed so that people can make their own decisions and put them into action. They need to be sure that it is safe for them and safe for the people we serve.&lt;/li&gt;&lt;li&gt;It is good to base important decisions on data but I have been learning that people can be misled by how it is presented. For instance, feedback from customers using our services might appear as anecdotes or narratives. Estimates for a large project will be presented as a set of numbers broken down across a range of dimensions in fine detail. We consistently put more weight on the numbers over the narrative when it should be the other way around. Customer feedback is valuable data for user research; estimates are just opinions in numerical form.&lt;/li&gt;&lt;li&gt;It is really hard to maintain external collaboration when working for a Council because our range of services is so diverse and complex. I still believe we need to find ways to share more across the sector but I now have a better understanding of why my colleagues are consumed by internal collaboration, and lack the time and energy to engage outside. I’ve pared back my own involvement to a few key activities and dropped out of some online collaboration platforms completely. I’m determined that this won’t be a permanent state of affairs but I will continue with a lot more sympathy for people that find it really hard to keep up.&lt;/li&gt;&lt;/ul&gt;&lt;h2 id=&quot;caring&quot;&gt;Caring&lt;/h2&gt;&lt;p&gt;For most of my career I was blind to issues of equality and, later, was just a passive and mostly silent supporter. In recent years, I have been trying to be a more active ally. I’ve tried to educate myself, got involved in events and initiatives to increase equality and have taken up the issues with friends, family and colleages. I still hesitate too often and wonder what people will think - I’ve spent more time editing this single paragraph than the whole of the rest of this yearnote. Poor me but, if that’s all I’ve got to worry about, I am a lot luckier than the people I’m trying to support.&lt;/p&gt;&lt;h4 id=&quot;footnotes&quot;&gt;Footnotes:&lt;/h4&gt;&lt;hr class=&quot;footnotes-sep&quot; /&gt;&lt;section class=&quot;footnotes&quot;&gt;&lt;ol class=&quot;footnotes-list&quot;&gt;&lt;li id=&quot;fn1&quot; class=&quot;footnote-item&quot;&gt;&lt;p&gt;&lt;a href=&quot;https://cioportfolio.github.io/2019/10/living-the-dream/&quot;&gt;A post about my big move a year ago&lt;/a&gt; &lt;a href=&quot;https://cioportfolio.github.io/2020/11/yearnote-4-november-2019-27-november-2020/#fnref1&quot; class=&quot;footnote-backref&quot;&gt;↩︎&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;li id=&quot;fn2&quot; class=&quot;footnote-item&quot;&gt;&lt;p&gt;This is a &lt;a href=&quot;https://productforthepeople.xyz/the-why-of-weeknotes-c1cd98967842&quot;&gt;good introduction to the idea of weeknotes&lt;/a&gt;. &lt;a href=&quot;https://cioportfolio.github.io/2020/11/yearnote-4-november-2019-27-november-2020/#fnref2&quot; class=&quot;footnote-backref&quot;&gt;↩︎&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;li id=&quot;fn3&quot; class=&quot;footnote-item&quot;&gt;&lt;p&gt;&lt;a href=&quot;https://agilecoachinginstitute.com/agile-coaching-resources/&quot;&gt;Some of the key roles of an agile coach&lt;/a&gt; &lt;a href=&quot;https://cioportfolio.github.io/2020/11/yearnote-4-november-2019-27-november-2020/#fnref3&quot; class=&quot;footnote-backref&quot;&gt;↩︎&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;li id=&quot;fn4&quot; class=&quot;footnote-item&quot;&gt;&lt;p&gt;There is a good introduction to these roles in the the UK Government &lt;a href=&quot;https://www.gov.uk/service-manual/the-team/what-each-role-does-in-service-team&quot;&gt;Service Manual&lt;/a&gt; &lt;a href=&quot;https://cioportfolio.github.io/2020/11/yearnote-4-november-2019-27-november-2020/#fnref4&quot; class=&quot;footnote-backref&quot;&gt;↩︎&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ol&gt;&lt;/section&gt;"},{"id":"https://cioportfolio.github.io/2020/02/refining-your-backlogs/","url":"https://cioportfolio.github.io/2020/02/refining-your-backlogs/","title":"Refining your backlogs","date_published":"2020-02-05T00:00:00Z","language":"","content_html":"&lt;p&gt;My previous update on Backlogs provided an introduction to the term. This post provides a little more detail on how to work with Backlogs.&lt;/p&gt;&lt;blockquote class=&quot;notice&quot;&gt;&lt;h4 id=&quot;about-agile-in-cornwall-council&quot;&gt;About agile in Cornwall Council&lt;/h4&gt;&lt;p&gt;We are starting to adopt more agile ways of working. My role involves helping people develop their skills and apply agile techniques to improve the services we provide to the public. This series of posts is adapted from the articles I write for our internal teams. They cover some common agile terms and what it all really means.&lt;/p&gt;&lt;/blockquote&gt;&lt;p&gt;In my first note&lt;sup class=&quot;footnote-ref&quot;&gt;&lt;a href=&quot;https://cioportfolio.github.io/2020/02/refining-your-backlogs/#fn1&quot; id=&quot;fnref1&quot;&gt;[1]&lt;/a&gt;&lt;/sup&gt; I described two types of backlogs, product backlogs and work backlogs, which have slightly different roles.&lt;/p&gt;&lt;h2 id=&quot;refining-your-product-backlog&quot;&gt;Refining your Product Backlog&lt;/h2&gt;&lt;p&gt;The product backlog is made up of the things that describe what your product or service will need to do for your users e.g. “let an officer capture the results of an inspection while they are away from the office”. Your first product backlog might be quite scrappy but the team can refine the backlog bit by bit each sprint&lt;sup class=&quot;footnote-ref&quot;&gt;&lt;a href=&quot;https://cioportfolio.github.io/2020/02/refining-your-backlogs/#fn2&quot; id=&quot;fnref2&quot;&gt;[2]&lt;/a&gt;&lt;/sup&gt;. The sorts of refinements you might see are:&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Moving the items around so the most important and urgent items go at the top of the list and less urgent and important ones move towards the bottom. Getting a good order that works for the team and other stakeholders is one of the key jobs of the product owner.&lt;/li&gt;&lt;li&gt;Rewording items to make them clearer with a user focused format (see our earlier post on user stories&lt;sup class=&quot;footnote-ref&quot;&gt;&lt;a href=&quot;https://cioportfolio.github.io/2020/02/refining-your-backlogs/#fn3&quot; id=&quot;fnref3&quot;&gt;[3]&lt;/a&gt;&lt;/sup&gt; for a common format but there are others you can use). People with business analysis experience are usually pretty good at helping the team do this.&lt;/li&gt;&lt;li&gt;Merging small items or breaking down large ones so that they are easier to manage (some of our teams are already using labels like story, feature, epic and theme to indicate the scale of the their items)&lt;/li&gt;&lt;li&gt;Adding additional information such as business impact, key constraints, estimates and acceptance criteria.&lt;/li&gt;&lt;/ul&gt;&lt;h2 id=&quot;refining-your-work-backlog&quot;&gt;Refining your Work Backlog&lt;/h2&gt;&lt;p&gt;The work backlog is made up of all of key tasks and activities that the team needs to do. Many of these will link directly to something on the product backlog e.g. “amend some code to implement a new feature”. There will usually be some housekeeping tasks such as setting up the team workspace and improvement activities coming out from regular team reviews. In the first sprints quite a lot of the work could be this sort of housekeeping but it is a good idea to have a mix each sprint. Generally, teams find that they don’t need much structure for the work backlog but typical things the team will do when planning a sprint is to:&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Review how much work they can realistically get done&lt;/li&gt;&lt;li&gt;Decide on what work is the highest priority&lt;/li&gt;&lt;li&gt;Juggle things around to get a sensible work list for the next sprint&lt;/li&gt;&lt;li&gt;Add other helpful information such as status of the work, sub-tasks or checklists, any external help needed and estimates&lt;sup class=&quot;footnote-ref&quot;&gt;&lt;a href=&quot;https://cioportfolio.github.io/2020/02/refining-your-backlogs/#fn4&quot; id=&quot;fnref4&quot;&gt;[4]&lt;/a&gt;&lt;/sup&gt;.&lt;/li&gt;&lt;/ul&gt;&lt;h4 id=&quot;footnotes&quot;&gt;Footnotes&lt;/h4&gt;&lt;hr class=&quot;footnotes-sep&quot; /&gt;&lt;section class=&quot;footnotes&quot;&gt;&lt;ol class=&quot;footnotes-list&quot;&gt;&lt;li id=&quot;fn1&quot; class=&quot;footnote-item&quot;&gt;&lt;p&gt;&lt;a href=&quot;https://cioportfolio.github.io/2019/11/an-introduction-to-backlogs/&quot;&gt;My introduction to backlogs&lt;/a&gt; &lt;a href=&quot;https://cioportfolio.github.io/2020/02/refining-your-backlogs/#fnref1&quot; class=&quot;footnote-backref&quot;&gt;↩︎&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;li id=&quot;fn2&quot; class=&quot;footnote-item&quot;&gt;&lt;p&gt;See an &lt;a href=&quot;https://cioportfolio.github.io/2019/11/so-what-exactly-is-a-sprint/&quot;&gt;earlier post&lt;/a&gt; about sprints. &lt;a href=&quot;https://cioportfolio.github.io/2020/02/refining-your-backlogs/#fnref2&quot; class=&quot;footnote-backref&quot;&gt;↩︎&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;li id=&quot;fn3&quot; class=&quot;footnote-item&quot;&gt;&lt;p&gt;&lt;a href=&quot;https://cioportfolio.github.io/2019/12/getting-started-with-user-stories/&quot;&gt;User stories post&lt;/a&gt; for more about backlogs. &lt;a href=&quot;https://cioportfolio.github.io/2020/02/refining-your-backlogs/#fnref3&quot; class=&quot;footnote-backref&quot;&gt;↩︎&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;li id=&quot;fn4&quot; class=&quot;footnote-item&quot;&gt;&lt;p&gt;Take a look at the previous post on &lt;a href=&quot;https://cioportfolio.github.io/2020/01/estimating-in-an-agile-way/&quot;&gt;estimating in an agile way&lt;/a&gt; &lt;a href=&quot;https://cioportfolio.github.io/2020/02/refining-your-backlogs/#fnref4&quot; class=&quot;footnote-backref&quot;&gt;↩︎&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ol&gt;&lt;/section&gt;"},{"id":"https://cioportfolio.github.io/2020/01/estimating-in-an-agile-way/","url":"https://cioportfolio.github.io/2020/01/estimating-in-an-agile-way/","title":"Estimating in an agile way","date_published":"2020-01-30T00:00:00Z","language":"","content_html":"&lt;p&gt;People would love it if we could predict the future. We get this all the time in our work:&lt;/p&gt;&lt;ul&gt;&lt;li&gt;How much is the project going to cost?&lt;/li&gt;&lt;li&gt;When will it be finished so that we can go live?&lt;/li&gt;&lt;li&gt;We are really busy so how much of Dave’s time do you need next month?&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;We only get the actual answers to these questions after the work is done (occasionally years later) but people need estimates, forecasts and indications to help coordinate people and activities. Agile ways of working do not immediately remove these needs but techniques like Scrum can help avoid some of the common pitfalls.&lt;/p&gt;&lt;blockquote class=&quot;notice&quot;&gt;&lt;h4 id=&quot;about-agile-in-cornwall-council&quot;&gt;About agile in Cornwall Council&lt;/h4&gt;&lt;p&gt;We are starting to adopt more agile ways of working. My role involves helping people develop their skills and apply agile techniques to improve the services we provide to the public. This series of posts is adapted from the articles I write for our internal teams. They cover some common agile terms and what it all really means.&lt;/p&gt;&lt;/blockquote&gt;&lt;h2 id=&quot;avoiding-the-common-estimating-pitfalls&quot;&gt;Avoiding the common estimating pitfalls&lt;/h2&gt;&lt;p&gt;Here are some examples of how agile ways of working can help:&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Agile approaches encourage stable, long-running teams which can make cost management much easier, especially in the public sector where money is often locked into specific financial periods.&lt;/li&gt;&lt;li&gt;Two people can take a very different amount of time to perform the same task. The agile emphasis on team working can smooth out these differences and be more predictable.&lt;/li&gt;&lt;li&gt;The timescales for delivery are often dominated by delays between work rather than the effort to complete the work. Multi-skilled teams working on small batches can massively reduce these delays.&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;How can you start to take advantage of agile ways of working in estimating? Here are some suggestions to get started.&lt;/p&gt;&lt;h2 id=&quot;engage-and-educate-your-stakeholders&quot;&gt;Engage and educate your stakeholders&lt;/h2&gt;&lt;p&gt;It is quite reasonable to ask for estimates but people can get into the habit of asking for far more detail and accuracy than they actually need and usually more than you need to manage your work well. You may also find that people have had a bad experience in the past and mistakenly use estimates to try to control teams, put people under pressure or to gain a negotiating advantage. Your stakeholders won’t change over-night but you can try to have an honest conversation about:&lt;/p&gt;&lt;ul&gt;&lt;li&gt;what information they really need to do their job&lt;/li&gt;&lt;li&gt;the unavoidable uncertainty involved in the kind of work we do&lt;/li&gt;&lt;li&gt;the sorts of things they can do to help the work go well.&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;Over time you may find people start asking for different things. Some people even stop asking for forecasts when they can see and touch what the team has delivered in regular demonstrations.&lt;/p&gt;&lt;h2 id=&quot;use-sprints-to-keep-improving-your-estimating&quot;&gt;Use sprints to keep improving your estimating&lt;/h2&gt;&lt;p&gt;Working in sprints&lt;sup class=&quot;footnote-ref&quot;&gt;&lt;a href=&quot;https://cioportfolio.github.io/2020/01/estimating-in-an-agile-way/#fn1&quot; id=&quot;fnref1&quot;&gt;[1]&lt;/a&gt;&lt;/sup&gt; does several things which help with estimating.&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Getting work done in small chunks sometimes eliminates the need to estimate. For example, waiting two weeks for the actual answer, or a much better informed answer could be better than an immediate but uninformed guess.&lt;/li&gt;&lt;li&gt;Sprints create a very fast feedback loop so you can see how accurate your estimates are, look at what you missed while it is fresh in your mind and see if you can adjust in the next sprint. For example, how much time was taken up by unplanned work and what allowance can you make for it next time?&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;Over a few sprints you will start to see patterns and trends&lt;sup class=&quot;footnote-ref&quot;&gt;&lt;a href=&quot;https://cioportfolio.github.io/2020/01/estimating-in-an-agile-way/#fn2&quot; id=&quot;fnref2&quot;&gt;[2]&lt;/a&gt;&lt;/sup&gt; which you can use to guide decisions. The sorts of things teams can do with this are:&lt;/p&gt;&lt;ul&gt;&lt;li&gt;make and maintain longer range estimates based upon actual delivery progress&lt;/li&gt;&lt;li&gt;improve risk management by understanding how steady or volatile their work is&lt;/li&gt;&lt;li&gt;make the case to automate or standardise things to make work more predicable.&lt;/li&gt;&lt;/ul&gt;&lt;h2 id=&quot;move-from-individual-to-team-based-estimates&quot;&gt;Move from individual to team-based estimates&lt;/h2&gt;&lt;p&gt;Individual estimates are really hard to get right because they are sensitive to so many factors:&lt;/p&gt;&lt;ul&gt;&lt;li&gt;do we know in advance what skills are need to complete the work and who in the team has these?&lt;/li&gt;&lt;li&gt;if the individual has the skills how proficient and productive are they?&lt;/li&gt;&lt;li&gt;if they are absent or busy on other things when the work is needed, what happens?&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;Looking at all of this at a team level can help by smoothing out the individual variations and allow the team to move work around as events play out. You end up with less precise but more robust estimates and, for many people, this is more useful that precise but volatile estimates. You can introduce team-based estimating by:&lt;/p&gt;&lt;ul&gt;&lt;li&gt;adding up the total amount of work that the whole team can do together in the next sprint&lt;/li&gt;&lt;li&gt;considering the total amount of work that could be needed to complete each backlog&lt;sup class=&quot;footnote-ref&quot;&gt;&lt;a href=&quot;https://cioportfolio.github.io/2020/01/estimating-in-an-agile-way/#fn3&quot; id=&quot;fnref3&quot;&gt;[3]&lt;/a&gt;&lt;/sup&gt; item&lt;/li&gt;&lt;li&gt;reviewing these estimates each sprint and then adjusting.&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;Some teams find it helpful to change the units they use for estimating (e.g. story points&lt;sup class=&quot;footnote-ref&quot;&gt;&lt;a href=&quot;https://cioportfolio.github.io/2020/01/estimating-in-an-agile-way/#fn4&quot; id=&quot;fnref4&quot;&gt;[4]&lt;/a&gt;&lt;/sup&gt; or t-shirt sizing) so they can cover things like risk and complexity along with quantity in a single measure of how hard a bit of work is.&lt;/p&gt;&lt;h4 id=&quot;footnotes&quot;&gt;Footnotes&lt;/h4&gt;&lt;hr class=&quot;footnotes-sep&quot; /&gt;&lt;section class=&quot;footnotes&quot;&gt;&lt;ol class=&quot;footnotes-list&quot;&gt;&lt;li id=&quot;fn1&quot; class=&quot;footnote-item&quot;&gt;&lt;p&gt;See an &lt;a href=&quot;https://cioportfolio.github.io/2019/11/so-what-exactly-is-a-sprint/&quot;&gt;earlier post&lt;/a&gt; about sprints. &lt;a href=&quot;https://cioportfolio.github.io/2020/01/estimating-in-an-agile-way/#fnref1&quot; class=&quot;footnote-backref&quot;&gt;↩︎&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;li id=&quot;fn2&quot; class=&quot;footnote-item&quot;&gt;&lt;p&gt;&lt;a href=&quot;https://www.agilealliance.org/glossary/burndown-chart&quot;&gt;Burndown charts&lt;/a&gt; are easy to make and can help you spot patterns and make more reliable forecasts. &lt;a href=&quot;https://cioportfolio.github.io/2020/01/estimating-in-an-agile-way/#fnref2&quot; class=&quot;footnote-backref&quot;&gt;↩︎&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;li id=&quot;fn3&quot; class=&quot;footnote-item&quot;&gt;&lt;p&gt;See the &lt;a href=&quot;https://cioportfolio.github.io/2019/11/an-introduction-to-backlogs/#what-is-a-product-backlo&quot;&gt;previous post&lt;/a&gt; for more about backlogs. &lt;a href=&quot;https://cioportfolio.github.io/2020/01/estimating-in-an-agile-way/#fnref3&quot; class=&quot;footnote-backref&quot;&gt;↩︎&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;li id=&quot;fn4&quot; class=&quot;footnote-item&quot;&gt;&lt;p&gt;There is lots to read up about story points. &lt;a href=&quot;https://www.mountaingoatsoftware.com/blog/what-are-story-points&quot;&gt;This one is quite an easy to read place to start&lt;/a&gt; &lt;a href=&quot;https://cioportfolio.github.io/2020/01/estimating-in-an-agile-way/#fnref4&quot; class=&quot;footnote-backref&quot;&gt;↩︎&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ol&gt;&lt;/section&gt;"},{"id":"https://cioportfolio.github.io/2019/12/getting-started-with-user-stories/","url":"https://cioportfolio.github.io/2019/12/getting-started-with-user-stories/","title":"Getting started with user stories","date_published":"2019-12-04T00:00:00Z","language":"","content_html":"&lt;p&gt;Think about the last time you bought something at a shop or online: Did you care what brand of vehicle delivered the goods? Probably not!&lt;/p&gt;&lt;p&gt;In the Cornwall Council IS team, our products exist to help people get things done and they, in turn, are helping other people get on with their lives. Often, as long as these people can do what they need, the details of how our products work do not matter very much to them.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;User stories&lt;/strong&gt; are a way of capturing the needs of our users and leaving out the rest of the details. They are very efficient, easy-to-use and have become the typical way for agile teams to define their products in the product backlog.&lt;/p&gt;&lt;blockquote class=&quot;notice&quot;&gt;&lt;h4 id=&quot;about-agile-in-cornwall-council&quot;&gt;About agile in Cornwall Council&lt;/h4&gt;&lt;p&gt;We are starting to adopt more agile ways of working. My role involves helping people develop their skills and apply agile techniques to improve the services we provide to the public. This series of posts is adapted from the articles I write for our internal teams. They cover some common agile terms and what it all really means.&lt;/p&gt;&lt;/blockquote&gt;&lt;h2 id=&quot;getting-to-the-heart-of-users-needs&quot;&gt;Getting to the heart of users needs&lt;/h2&gt;&lt;p&gt;Most of our teams have seen the default format for a user story by now&lt;sup class=&quot;footnote-ref&quot;&gt;&lt;a href=&quot;https://cioportfolio.github.io/2019/12/getting-started-with-user-stories/#fn1&quot; id=&quot;fnref1&quot;&gt;[1]&lt;/a&gt;&lt;/sup&gt;:&lt;/p&gt;&lt;blockquote class=&quot;notice&quot;&gt;&lt;p&gt;As a &lt;strong&gt;&amp;lt;type of person, role, group&amp;gt;&lt;/strong&gt; I want &lt;strong&gt;&amp;lt;something&amp;gt;&lt;/strong&gt; so that &lt;strong&gt;&amp;lt;some outcome&amp;gt;&lt;/strong&gt;&lt;/p&gt;&lt;/blockquote&gt;&lt;p&gt;The &lt;strong&gt;something&lt;/strong&gt; is a part (potentially a tiny part) of our product. The sum total of these stories, and there could be thousands of them, defines our product. The collection of &lt;strong&gt;people&lt;/strong&gt;, &lt;strong&gt;roles&lt;/strong&gt; and &lt;strong&gt;groups&lt;/strong&gt; define who we are intending to help, while the collection of &lt;strong&gt;outcomes&lt;/strong&gt; captures what those people are trying to achieve.&lt;/p&gt;&lt;p&gt;This seems very simple but, as skilled professionals, do we need anything else to do our work?&lt;/p&gt;&lt;h2 id=&quot;working-with-your-user-stories&quot;&gt;Working with your user stories&lt;/h2&gt;&lt;p&gt;As well as collecting stories in your product backlog&lt;sup class=&quot;footnote-ref&quot;&gt;&lt;a href=&quot;https://cioportfolio.github.io/2019/12/getting-started-with-user-stories/#fn2&quot; id=&quot;fnref2&quot;&gt;[2]&lt;/a&gt;&lt;/sup&gt; you can:&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Break them down into smaller sub-stories to help plan delivery&lt;/li&gt;&lt;li&gt;Sort them into larger groups (often called features, epics or themes) to help manage priorities&lt;/li&gt;&lt;li&gt;Annotate them with additional details (acceptance criteria are a common annotation)&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;Writing user stories gets quicker and easier with practice, and the stories in your backlog will get better through discussion amongst the team and your users&lt;sup class=&quot;footnote-ref&quot;&gt;&lt;a href=&quot;https://cioportfolio.github.io/2019/12/getting-started-with-user-stories/#fn3&quot; id=&quot;fnref3&quot;&gt;[3]&lt;/a&gt;&lt;/sup&gt;. If you find it difficult at first, don’t worry. You are not alone! To get started, just have a go and write something down and you can revisit and update your stories in later sprints&lt;sup class=&quot;footnote-ref&quot;&gt;&lt;a href=&quot;https://cioportfolio.github.io/2019/12/getting-started-with-user-stories/#fn4&quot; id=&quot;fnref4&quot;&gt;[4]&lt;/a&gt;&lt;/sup&gt;.&lt;/p&gt;&lt;p&gt;&lt;img src=&quot;https://cioportfolio.github.io/images/cornwallboard3_reduced.PNG&quot; alt=&quot;Example stories&quot; :=&quot;&quot; class=&quot;align-left&quot; style=&quot;max-height: 250px&quot; /&gt;Team Bumblebee&lt;sup class=&quot;footnote-ref&quot;&gt;&lt;a href=&quot;https://cioportfolio.github.io/2019/12/getting-started-with-user-stories/#fn5&quot; id=&quot;fnref5&quot;&gt;[5]&lt;/a&gt;&lt;/sup&gt; is going through this learning process at the moment, and it will be obvious if you have a look at the stories in our backlog. Some of the items have come from creative team-working sessions and still need to be refined into user story format. Some of our stories are a little self-centred (written as if the team members are the users) so we need to keep working on how these items will help others and capture that more clearly. We’ll get better at it as we go.&lt;/p&gt;&lt;h2 id=&quot;when-the-going-gets-tough&quot;&gt;When the going gets tough&lt;/h2&gt;&lt;p&gt;Sometimes, you’ll know you need to get something into your backlog but just can’t find an easy way to get it into a user story format. That’s ok! Capture the idea so it doesn’t get lost and revisit it later. You might also want to ask the following questions:&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Who else wants the thing you have written? If it is just you, should we really spend time on it?&lt;/li&gt;&lt;li&gt;Why do they want it? If there is no value, should we drop it?&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;If you can find the &lt;strong&gt;what&lt;/strong&gt;, &lt;strong&gt;who&lt;/strong&gt; and the &lt;strong&gt;why&lt;/strong&gt; you probably have enough for a user story. If not, you probably shouldn’t be working on it.&lt;/p&gt;&lt;h2 id=&quot;an-exercise&quot;&gt;An exercise&lt;/h2&gt;&lt;p&gt;At the start, we talked about shopping and not caring about how your goods arrived. Perhaps you would care if they arrived in a poorly maintained, highly polluting, old diesel van. Can you capture that in a user story? Go on, have a go!&lt;/p&gt;&lt;h4 id=&quot;footnotes&quot;&gt;Footnotes&lt;/h4&gt;&lt;hr class=&quot;footnotes-sep&quot; /&gt;&lt;section class=&quot;footnotes&quot;&gt;&lt;ol class=&quot;footnotes-list&quot;&gt;&lt;li id=&quot;fn1&quot; class=&quot;footnote-item&quot;&gt;&lt;p&gt;If you are brand new to this topic take a look at Mark Shead’s &lt;a href=&quot;https://www.youtube.com/watch?v=apOvF9NVguA&quot;&gt;video on you tube&lt;/a&gt;. &lt;a href=&quot;https://cioportfolio.github.io/2019/12/getting-started-with-user-stories/#fnref1&quot; class=&quot;footnote-backref&quot;&gt;↩︎&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;li id=&quot;fn2&quot; class=&quot;footnote-item&quot;&gt;&lt;p&gt;See the &lt;a href=&quot;https://cioportfolio.github.io/2019/11/an-introduction-to-backlogs/#what-is-a-product-backlo&quot;&gt;previous post&lt;/a&gt; for more about the product backlog. &lt;a href=&quot;https://cioportfolio.github.io/2019/12/getting-started-with-user-stories/#fnref2&quot; class=&quot;footnote-backref&quot;&gt;↩︎&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;li id=&quot;fn3&quot; class=&quot;footnote-item&quot;&gt;&lt;p&gt;Some people would say that the written story is just a placeholder for a conversation. This is a really good way to think about it and fits with the agile approach of valuing individuals and interactions over processes and tools. &lt;a href=&quot;https://cioportfolio.github.io/2019/12/getting-started-with-user-stories/#fnref3&quot; class=&quot;footnote-backref&quot;&gt;↩︎&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;li id=&quot;fn4&quot; class=&quot;footnote-item&quot;&gt;&lt;p&gt;The &lt;a href=&quot;https://cioportfolio.github.io/2019/11/so-what-exactly-is-a-sprint/&quot;&gt;first post in this series&lt;/a&gt; covered what sprints are. &lt;a href=&quot;https://cioportfolio.github.io/2019/12/getting-started-with-user-stories/#fnref4&quot; class=&quot;footnote-backref&quot;&gt;↩︎&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;li id=&quot;fn5&quot; class=&quot;footnote-item&quot;&gt;&lt;p&gt;Team Bumblee is a part-time Scrum team overseeing the agile transformation in the Cornwall Council IS department and we have written our stories on our physical scum board on a wall in New County Hall. &lt;a href=&quot;https://cioportfolio.github.io/2019/12/getting-started-with-user-stories/#fnref5&quot; class=&quot;footnote-backref&quot;&gt;↩︎&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ol&gt;&lt;/section&gt;"},{"id":"https://cioportfolio.github.io/2019/11/an-introduction-to-backlogs/","url":"https://cioportfolio.github.io/2019/11/an-introduction-to-backlogs/","title":"An introduction to backlogs","date_published":"2019-11-27T00:00:00Z","language":"","content_html":"&lt;p&gt;In this post, we’re taking a closer look at another agile term: &lt;em&gt;Backlog&lt;/em&gt;. The dictionary definition is:&lt;/p&gt;&lt;blockquote&gt;&lt;p&gt;an accumulation of tasks unperformed or materials not processed&lt;/p&gt;&lt;/blockquote&gt;&lt;p&gt;In agile working, backlogs are a list of things that a team still has to do. If you are struggling to get started, brainstorming a list of what a team needs to do is a good first step.&lt;/p&gt;&lt;blockquote class=&quot;notice&quot;&gt;&lt;h4 id=&quot;about-agile-in-cornwall-council&quot;&gt;About agile in Cornwall Council&lt;/h4&gt;&lt;p&gt;We are starting to adopt more agile ways of working. My role involves helping people develop their skills and apply agile techniques to improve the services we provide to the public. This series of posts is adapted from the articles I write for our internal teams. They cover some common agile terms and what it all really means.&lt;/p&gt;&lt;/blockquote&gt;&lt;h2 id=&quot;getting-your-work-organised&quot;&gt;Getting your work organised&lt;/h2&gt;&lt;p&gt;For most teams, organising your backlog&lt;sup class=&quot;footnote-ref&quot;&gt;&lt;a href=&quot;https://cioportfolio.github.io/2019/11/an-introduction-to-backlogs/#fn1&quot; id=&quot;fnref1&quot;&gt;[1]&lt;/a&gt;&lt;/sup&gt; can help. Start by sorting your list into a &lt;strong&gt;product backlog&lt;/strong&gt; and a &lt;strong&gt;work backlog&lt;/strong&gt;.&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;h3 id=&quot;what-is-a-product-backlog&quot;&gt;What is a Product Backlog?  &lt;img src=&quot;https://cioportfolio.github.io/images/cornwallboard3_reduced.PNG&quot; alt=&quot;Example scrappy board&quot; :=&quot;&quot; class=&quot;align-right&quot; style=&quot;max-height: 350px&quot; /&gt;&lt;/h3&gt;&lt;p&gt;The product backlog is made up of the things that describe what the product orservice you are building needs to do for your users. Your first product backlog might be quite scrappy (see the Bumblebee board&lt;sup class=&quot;footnote-ref&quot;&gt;&lt;a href=&quot;https://cioportfolio.github.io/2019/11/an-introduction-to-backlogs/#fn2&quot; id=&quot;fnref2&quot;&gt;[2]&lt;/a&gt;&lt;/sup&gt; for an example of how scrappy this can be!) but the team can refine the backlog gradually through each sprint.&lt;/p&gt;&lt;/li&gt;&lt;li&gt;&lt;h3 id=&quot;what-is-a-work-backlog&quot;&gt;What is a Work Backlog?&lt;/h3&gt;&lt;p&gt;The work backlog is made up of all of the key tasks and activities that the teamneeds to do. Many of these will link to something directly on the product backlog e.g. amending code to implement a new feature. There will usually be some housekeeping tasks such as setting up the team workspace and improvement activities coming out from regular team reviews. In the first sprint, quite a lot of the work could be this sort of housekeeping, but it is a good idea to have a mix of work in each sprint.&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;img src=&quot;https://cioportfolio.github.io/images/cornwallboardx_reduced.PNG&quot; alt=&quot;Example azure board&quot; :=&quot;&quot; class=&quot;align-left&quot; style=&quot;max-width:400px&quot; /&gt;You can keep track of your backlogs in a variety of ways. Some use sticky notes and white boards and there are others who use software tools. Many of the IS teams at Cornwall use Azure Boards&lt;sup class=&quot;footnote-ref&quot;&gt;&lt;a href=&quot;https://cioportfolio.github.io/2019/11/an-introduction-to-backlogs/#fn3&quot; id=&quot;fnref3&quot;&gt;[3]&lt;/a&gt;&lt;/sup&gt;. Some teams keep their product and work backlogs separate, while others use a single list with labels.&lt;/p&gt;&lt;p&gt;&lt;img src=&quot;https://cioportfolio.github.io/images/cornwallboard4_reduced.PNG&quot; alt=&quot;Example MI board&quot; :=&quot;&quot; class=&quot;align-right&quot; style=&quot;max-width:400px&quot; /&gt;Backlogs can be a great source of management information. Some of our teams are already generating this in real-time as their work progresses.&lt;/p&gt;&lt;p&gt;Most teams can get what they need from product and work backlogs, but youmay come across teams using other backlogs covering things such as servicerequests, architecture, enablers and risks.&lt;/p&gt;&lt;h4 id=&quot;footnotes&quot;&gt;Footnotes&lt;/h4&gt;&lt;hr class=&quot;footnotes-sep&quot; /&gt;&lt;section class=&quot;footnotes&quot;&gt;&lt;ol class=&quot;footnotes-list&quot;&gt;&lt;li id=&quot;fn1&quot; class=&quot;footnote-item&quot;&gt;&lt;p&gt;&lt;a href=&quot;https://www.agilealliance.org/glossary/backlog/&quot;&gt;Agile backlog definition&lt;/a&gt; &lt;a href=&quot;https://cioportfolio.github.io/2019/11/an-introduction-to-backlogs/#fnref1&quot; class=&quot;footnote-backref&quot;&gt;↩︎&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;li id=&quot;fn2&quot; class=&quot;footnote-item&quot;&gt;&lt;p&gt;Team Bumblee is a part-time Scrum team overseeing the agile transformation in the Cornwall Council IS department and our Scum board is on the wall in New County Hall. In theory, the team should be showing the way in applying agile ideas but several of our product and service teams have passed us. &lt;a href=&quot;https://cioportfolio.github.io/2019/11/an-introduction-to-backlogs/#fnref2&quot; class=&quot;footnote-backref&quot;&gt;↩︎&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;li id=&quot;fn3&quot; class=&quot;footnote-item&quot;&gt;&lt;p&gt;&lt;a href=&quot;https://docs.microsoft.com/en-us/azure/devops/boards/get-started/what-is-azure-boards&quot;&gt;Azure Boards&lt;/a&gt; &lt;a href=&quot;https://cioportfolio.github.io/2019/11/an-introduction-to-backlogs/#fnref3&quot; class=&quot;footnote-backref&quot;&gt;↩︎&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ol&gt;&lt;/section&gt;"},{"id":"https://cioportfolio.github.io/2019/11/so-what-exactly-is-a-sprint/","url":"https://cioportfolio.github.io/2019/11/so-what-exactly-is-a-sprint/","title":"So, what exactly is a sprint?","date_published":"2019-11-21T00:00:00Z","language":"","content_html":"&lt;p&gt;I don’t think the people behind Scrum and other agile methods participated in sports very much. They seem to have borrowed a lot of sporting terms but haven’t used them very wisely.&lt;/p&gt;&lt;p&gt;The phrase “Sprint” is a good example of this. In athletics, a sprint involves individuals trying to run faster than everyone else over a short distance. This might be how your team feels at the moment, but it probably isn’t a good picture of where we would like to be.&lt;/p&gt;&lt;blockquote class=&quot;notice&quot;&gt;&lt;h4 id=&quot;about-agile-in-cornwall-council&quot;&gt;About agile in Cornwall Council&lt;/h4&gt;&lt;p&gt;We are starting to adopt more agile ways of working. My role involves helping people develop their skills and apply agile techniques to improve the services we provide to the public. This series of posts is adapted from the articles I write for our internal teams. They cover some common agile terms and what it all really means.&lt;/p&gt;&lt;/blockquote&gt;&lt;h2 id=&quot;mixed-metaphores&quot;&gt;Mixed metaphores&lt;/h2&gt;&lt;p&gt;In product development, a sprint is a repeating cycle of activities which is designed to manage risk and deliver a steady flow of business benefits. By regularly finishing small pieces of work and receiving fast feedback, teams can learn what works, deal with problems quickly, and use this experience to improve in subsequent sprints.&lt;/p&gt;&lt;p class=&quot;notice&quot;&gt;Sprints vary in shape and size but most people start with the suggestions in the Scrum Guide&lt;sup class=&quot;footnote-ref&quot;&gt;&lt;a href=&quot;https://cioportfolio.github.io/2019/11/so-what-exactly-is-a-sprint/#fn1&quot; id=&quot;fnref1&quot;&gt;[1]&lt;/a&gt;&lt;/sup&gt;.&lt;/p&gt;&lt;p&gt;At the start of each sprint, the team confirms what work it intends to complete and how the work will be done. During the sprint, the team does the work and has regular, short meetings to keep on track. At the end of the sprint, the team reviews both what has been completed and how it was done. Lessons from these reviews are fed into planning the next sprint.&lt;/p&gt;&lt;p&gt;The Scrum Guide is very short and only covers generic good practice. It doesn’t cover everything that a real team might need to do, so you may come across some challenges or myths when putting sprints into practice. Here are a few common ones:&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;&lt;strong&gt;Sprints are only for teams writing code, aren’t they?&lt;/strong&gt; It is true that a lot is written about sprints for software development, and software engineers think they created these ideas, but the principles are much older and were initially developed for traditional manufacturing processes.&lt;/p&gt;&lt;/li&gt;&lt;li&gt;&lt;p&gt;&lt;strong&gt;Only plan for the next two weeks? That’s crazy!&lt;/strong&gt; Sprint planning does focus on the next sprint, but sprints aren’t always two weeks long and, anyway, this isn’t the only type of planning that a team does.&lt;/p&gt;&lt;/li&gt;&lt;li&gt;&lt;p&gt;&lt;strong&gt;What about all the good stuff I learnt from working on projects?&lt;/strong&gt; Agile techniques (like sprints) are good for handling certain types of risks such as uncertainty and volatility. Traditional project management techniques are good for handling other sorts of risks such as large, unfamiliar investments. They can work together and many teams find that they have both types of risk and need to dip into both sets of techniques.&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;h2 id=&quot;where-to-go-next-for-more&quot;&gt;Where to go next for more&lt;/h2&gt;&lt;p&gt;More of a visual learner? There are loads of great resources you can find with a quick search. For example, there are videos&lt;sup class=&quot;footnote-ref&quot;&gt;&lt;a href=&quot;https://cioportfolio.github.io/2019/11/so-what-exactly-is-a-sprint/#fn2&quot; id=&quot;fnref2&quot;&gt;[2]&lt;/a&gt;&lt;/sup&gt; on fundamental principles of a Scrum which are less than 10 minutes long!&lt;/p&gt;&lt;h4 id=&quot;footnotes&quot;&gt;Footnotes&lt;/h4&gt;&lt;hr class=&quot;footnotes-sep&quot; /&gt;&lt;section class=&quot;footnotes&quot;&gt;&lt;ol class=&quot;footnotes-list&quot;&gt;&lt;li id=&quot;fn1&quot; class=&quot;footnote-item&quot;&gt;&lt;p&gt;&lt;a href=&quot;https://www.scrumguides.org/scrum-guide.html&quot;&gt;The Scrum Guide&lt;/a&gt; &lt;a href=&quot;https://cioportfolio.github.io/2019/11/so-what-exactly-is-a-sprint/#fnref1&quot; class=&quot;footnote-backref&quot;&gt;↩︎&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;li id=&quot;fn2&quot; class=&quot;footnote-item&quot;&gt;&lt;p&gt;&lt;a href=&quot;https://www.youtube.com/watch?v=9TycLR0TqFA&quot;&gt;Introduction to Scrum - 7 minutes&lt;/a&gt; &lt;a href=&quot;https://cioportfolio.github.io/2019/11/so-what-exactly-is-a-sprint/#fnref2&quot; class=&quot;footnote-backref&quot;&gt;↩︎&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ol&gt;&lt;/section&gt;"},{"id":"https://cioportfolio.github.io/2019/10/living-the-dream/","url":"https://cioportfolio.github.io/2019/10/living-the-dream/","title":"Living the dream","date_published":"2019-10-04T00:00:00Z","language":"","content_html":"&lt;p&gt;Today is a big deal for me. For the last few years I have had a ball with colleagues at NTT DATA; working on digital and agile transformation whilst learning and sharing with a group of really smart and friendly people. From today, I am going to be working on digital and agile transformation whilst learning and sharing with a group of really smart and friendly people. So what’s changed?&lt;/p&gt;&lt;h2 id=&quot;sunrise-over-a-new-horizon&quot;&gt;Sunrise over a new horizon&lt;/h2&gt;&lt;p&gt;The big deal is that today is my first day as an Agile Coach in Cornwall Council.&lt;/p&gt;&lt;p&gt;Most people will know Cornwall as a holiday destination - the sea, moors and other attractions bring in 5 million visitors each year. However, half a million people call it home and have many of the same needs and aspirations as people all over the country. Digital technologies and new ways of working are making Cornwall’s remoteness from the UK’s big city economies less of an obstacle to business and remoteness can be an advantage if you are doing something new, for instance, horizontal space launches&lt;sup class=&quot;footnote-ref&quot;&gt;&lt;a href=&quot;https://cioportfolio.github.io/2019/10/living-the-dream/#fn1&quot; id=&quot;fnref1&quot;&gt;[1]&lt;/a&gt;&lt;/sup&gt;. Cornwall Council has a role to play in all of this; helping people overcome some long standing problems and also take advantage of the new opportunities that are opening up.&lt;/p&gt;&lt;p&gt;I will start working with a range of digital and technology teams in the Council to help them apply some new agile ways of working that have proven to be successful in the private sector and other parts of the Central and Local Government. The goal is to create more effective and better value services for everyone that the Council serves.&lt;/p&gt;&lt;p&gt;I have some of my own experiences to share but I am also hoping to tap into an amazing network of like-minded people working across the public sector. I am also hoping to learn how to apply agile techniques to other things the Council does, including understanding what the people of Cornwall need and how the Council works with others to meet these needs. There will often be a digital and technical part of this work but it might also touch everything from policy development to processing household waste.&lt;/p&gt;&lt;h2 id=&quot;the-familiar-sunshine&quot;&gt;The familiar sunshine&lt;/h2&gt;&lt;p&gt;A new job in a new place ought to feel alien but it actually feels remarkably comfortable. Over the last few years I have spent many wonderful days in Cornwall and have been visiting three or four times a year recently. On a professional level, I have had the honour of being a member of the Local Government Digital community for some time and have volunteered in a number of public sector and third sector groups and events. I’ve got loads to learn and I hope these communities will forgive a whole load of “dumb” questions from me over the coming weeks and months.&lt;/p&gt;&lt;h4 id=&quot;footnotes&quot;&gt;Footnotes&lt;/h4&gt;&lt;hr class=&quot;footnotes-sep&quot; /&gt;&lt;section class=&quot;footnotes&quot;&gt;&lt;ol class=&quot;footnotes-list&quot;&gt;&lt;li id=&quot;fn1&quot; class=&quot;footnote-item&quot;&gt;&lt;p&gt;&lt;a href=&quot;https://www.cornwalllive.com/news/cornwall-news/cornwall-spaceport-latest-council-cabinet-3332557&quot;&gt;Newquay Spaceport News&lt;/a&gt; &lt;a href=&quot;https://cioportfolio.github.io/2019/10/living-the-dream/#fnref1&quot; class=&quot;footnote-backref&quot;&gt;↩︎&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ol&gt;&lt;/section&gt;"},{"id":"https://cioportfolio.github.io/2018/01/getting-shared-services-to-work/","url":"https://cioportfolio.github.io/2018/01/getting-shared-services-to-work/","title":"Getting shared services to work","date_published":"2018-01-21T00:00:00Z","language":"","content_html":"&lt;p&gt;In my last post&lt;sup class=&quot;footnote-ref&quot;&gt;&lt;a href=&quot;https://cioportfolio.github.io/2018/01/getting-shared-services-to-work/#fn1&quot; id=&quot;fnref1&quot;&gt;[1]&lt;/a&gt;&lt;/sup&gt; I mentioned that I was going to make a pitch about the UK Government Shared Services Strategy&lt;sup class=&quot;footnote-ref&quot;&gt;&lt;a href=&quot;https://cioportfolio.github.io/2018/01/getting-shared-services-to-work/#fn2&quot; id=&quot;fnref2&quot;&gt;[2]&lt;/a&gt;&lt;/sup&gt; at &lt;a href=&quot;https://www.ukgovcamp.com/&quot;&gt;UKGovCamp&lt;/a&gt;. In the end I didn’t need to pitch as &lt;a href=&quot;https://twitter.com/lexij&quot;&gt;@lexij&lt;/a&gt; got there first with a great title: &lt;em&gt;The Shared Services Strategy - OMG! Let’s fix it&lt;/em&gt;. This post is a personal reflection on what was discussed but the raw notes from the session are also available online&lt;sup class=&quot;footnote-ref&quot;&gt;&lt;a href=&quot;https://cioportfolio.github.io/2018/01/getting-shared-services-to-work/#fn3&quot; id=&quot;fnref3&quot;&gt;[3]&lt;/a&gt;&lt;/sup&gt;.&lt;/p&gt;&lt;h2 id=&quot;doing-the-same-thing-and-expecting-a-different-result&quot;&gt;Doing the same thing and expecting a different result&lt;/h2&gt;&lt;p&gt;The theory that business services always get better as they get bigger is persistent but the econmies of scale have turned out to be elusive. The most recent attempt in Central Government&lt;sup class=&quot;footnote-ref&quot;&gt;&lt;a href=&quot;https://cioportfolio.github.io/2018/01/getting-shared-services-to-work/#fn4&quot; id=&quot;fnref4&quot;&gt;[4]&lt;/a&gt;&lt;/sup&gt; has produced disappointing results&lt;sup class=&quot;footnote-ref&quot;&gt;&lt;a href=&quot;https://cioportfolio.github.io/2018/01/getting-shared-services-to-work/#fn5&quot; id=&quot;fnref5&quot;&gt;[5]&lt;/a&gt;&lt;/sup&gt;, so far, but the new strategy retains many of the same elements. Some examples that got my attention in the latest strategy were:&lt;/p&gt;&lt;ul&gt;&lt;li&gt;The UK Government has a lot of buying power and can effectively wield this to get good value from technology and service centre suppliers.&lt;/li&gt;&lt;li&gt;The notoriously poor user interfaces of the leading ERP systems can be addressed by bolting on a new shared front-end.&lt;/li&gt;&lt;li&gt;Limiting the technology options will help align back-office operations in spite of fragmented funding and governance.&lt;/li&gt;&lt;li&gt;Innovation in back-office services (such as automation and artificial intelligence) is unlikely to change the operating model or supplier landscape very much over 10 years.&lt;/li&gt;&lt;li&gt;Experience from industry means we can be confident this is the right direction and approach.&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;What evidence do we have that the new strategy will produce better results? Perhaps the assumptions behind the strategy could be made to work but there is plenty of evidence which points the other way&lt;sup class=&quot;footnote-ref&quot;&gt;&lt;a href=&quot;https://cioportfolio.github.io/2018/01/getting-shared-services-to-work/#fn6&quot; id=&quot;fnref6&quot;&gt;[6]&lt;/a&gt;&lt;/sup&gt;. What other options were considered and ruled out?&lt;/p&gt;&lt;h2 id=&quot;give-digital-another-chance&quot;&gt;Give Digital another chance&lt;/h2&gt;&lt;p&gt;&lt;a href=&quot;https://twitter.com/tomskitomski&quot;&gt;@tomskitomski&lt;/a&gt; defines “Digital” as: applying the culture, practices, processes &amp;amp; technologies of the Internet-era to respond to people’s raised expectations. This thinking has proven so successful that all public facing transactional services must now be developed this way&lt;sup class=&quot;footnote-ref&quot;&gt;&lt;a href=&quot;https://cioportfolio.github.io/2018/01/getting-shared-services-to-work/#fn7&quot; id=&quot;fnref7&quot;&gt;[7]&lt;/a&gt;&lt;/sup&gt;. Why not apply this approach to back-office business services? A few years ago some teams started to look at this&lt;sup class=&quot;footnote-ref&quot;&gt;&lt;a href=&quot;https://cioportfolio.github.io/2018/01/getting-shared-services-to-work/#fn8&quot; id=&quot;fnref8&quot;&gt;[8]&lt;/a&gt;&lt;/sup&gt; and I would like to hear more about how far they got and what they discovered.&lt;/p&gt;&lt;p&gt;A more digital approach would come with its own set of challenges, including:&lt;/p&gt;&lt;ul&gt;&lt;li&gt;is this the best use of relatively scarce digital skills?&lt;/li&gt;&lt;li&gt;will the benefits be so much greater than buying complete services and systems from the market?&lt;/li&gt;&lt;li&gt;will it be any more successful if the funding and governance issues are not addressed?&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;I don’t think anyone promoting a more digital approach would suggest it would be an easy option but a wise response would be to proceed with caution and learn along the way - not abandon the idea altogether.&lt;/p&gt;&lt;h2 id=&quot;the-3rd-way&quot;&gt;The 3rd Way&lt;/h2&gt;&lt;p&gt;The authors of the Shared Services Strategy and the attendees at UKGovCamp are clearly approaching this from very different positions but we don’t need to stop there. As &lt;a href=&quot;https://twitter.com/liammax&quot;&gt;@liammax&lt;/a&gt; suggests we could work together to make it a success.&lt;/p&gt;&lt;blockquote class=&quot;twitter-tweet&quot; data-lang=&quot;en&quot;&gt;&lt;p lang=&quot;en&quot; dir=&quot;ltr&quot;&gt;8/ So I’m going to advise that we help this team make something properly good, the leader of it is open to constructive feedback and in that sense it’s a great opportunity.&lt;/p&gt;&amp;mdash; Liam Maxwell (@liammax) &lt;a href=&quot;https://twitter.com/liammax/status/952289542022795265?ref_src=twsrc%5Etfw&quot;&gt;January 13, 2018&lt;/a&gt;&lt;/blockquote&gt;&lt;script async=&quot;&quot; src=&quot;https://platform.twitter.com/widgets.js&quot; charset=&quot;utf-8&quot;&gt;&lt;/script&gt;&lt;p&gt;How can we do this in practice? Alongside the main ERP vendors the strategy includes a 3rd sponsored platform. This is intended to be “modern” and “provide a cheaper, more flexible alternative” to Oracle and SAP. Why not develop the 3rd platform using the Government Service Manual&lt;sup class=&quot;footnote-ref&quot;&gt;&lt;a href=&quot;https://cioportfolio.github.io/2018/01/getting-shared-services-to-work/#fn9&quot; id=&quot;fnref9&quot;&gt;[9]&lt;/a&gt;&lt;/sup&gt;? This might not result in a single integrated alternative to SAP and Oracle but then the choice of technology might not be the biggest obstacle in discovering and addressing the real needs. We can’t be sure that a digital 3rd platform would become a great success but there is certainly room in a programme of this scale to experiment and iterate with an approach that has proven so effective in other circumstances.&lt;/p&gt;&lt;h4 id=&quot;footnotes&quot;&gt;Footnotes&lt;/h4&gt;&lt;hr class=&quot;footnotes-sep&quot; /&gt;&lt;section class=&quot;footnotes&quot;&gt;&lt;ol class=&quot;footnotes-list&quot;&gt;&lt;li id=&quot;fn1&quot; class=&quot;footnote-item&quot;&gt;&lt;p&gt;&lt;a href=&quot;https://cioportfolio.github.io/2018/01/will-shared-services-ever-work/&quot;&gt;Blog post: Will shared services ever work?&lt;/a&gt; &lt;a href=&quot;https://cioportfolio.github.io/2018/01/getting-shared-services-to-work/#fnref1&quot; class=&quot;footnote-backref&quot;&gt;↩︎&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;li id=&quot;fn2&quot; class=&quot;footnote-item&quot;&gt;&lt;p&gt;&lt;a href=&quot;https://www.gov.uk/government/publications/a-shared-services-strategy-for-government&quot;&gt;UK Government Shared Services Strategy&lt;/a&gt; &lt;a href=&quot;https://cioportfolio.github.io/2018/01/getting-shared-services-to-work/#fnref2&quot; class=&quot;footnote-backref&quot;&gt;↩︎&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;li id=&quot;fn3&quot; class=&quot;footnote-item&quot;&gt;&lt;p&gt;&lt;a href=&quot;https://j.mp/ukgc18s3r1a&quot;&gt;Raw notes from the UK Gov Camp shared services session&lt;/a&gt; &lt;a href=&quot;https://cioportfolio.github.io/2018/01/getting-shared-services-to-work/#fnref3&quot; class=&quot;footnote-backref&quot;&gt;↩︎&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;li id=&quot;fn4&quot; class=&quot;footnote-item&quot;&gt;&lt;p&gt;&lt;a href=&quot;https://www.gov.uk/government/publications/next-generation-shared-services-strategic-plan&quot;&gt;Previous UK Government Shared Services Strategy&lt;/a&gt; &lt;a href=&quot;https://cioportfolio.github.io/2018/01/getting-shared-services-to-work/#fnref4&quot; class=&quot;footnote-backref&quot;&gt;↩︎&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;li id=&quot;fn5&quot; class=&quot;footnote-item&quot;&gt;&lt;p&gt;&lt;a href=&quot;https://www.nao.org.uk/report/shared-service-centres/&quot;&gt;UK National Audit Office report on shared services&lt;/a&gt; &lt;a href=&quot;https://cioportfolio.github.io/2018/01/getting-shared-services-to-work/#fnref5&quot; class=&quot;footnote-backref&quot;&gt;↩︎&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;li id=&quot;fn6&quot; class=&quot;footnote-item&quot;&gt;&lt;p&gt;&lt;a href=&quot;https://vanguard-method.net/2018/01/do-shared-services-bake-bread/&quot;&gt;Do shared services bake bread?&lt;/a&gt; &lt;a href=&quot;https://cioportfolio.github.io/2018/01/getting-shared-services-to-work/#fnref6&quot; class=&quot;footnote-backref&quot;&gt;↩︎&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;li id=&quot;fn7&quot; class=&quot;footnote-item&quot;&gt;&lt;p&gt;&lt;a href=&quot;https://www.gov.uk/service-manual/service-standard&quot;&gt;UK Government Service Standard&lt;/a&gt; &lt;a href=&quot;https://cioportfolio.github.io/2018/01/getting-shared-services-to-work/#fnref7&quot; class=&quot;footnote-backref&quot;&gt;↩︎&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;li id=&quot;fn8&quot; class=&quot;footnote-item&quot;&gt;&lt;p&gt;&lt;a href=&quot;https://gds.blog.gov.uk/2015/09/28/civil-servants-are-users-too/&quot;&gt;Blog post on applying the service standard for back-office services&lt;/a&gt; &lt;a href=&quot;https://cioportfolio.github.io/2018/01/getting-shared-services-to-work/#fnref8&quot; class=&quot;footnote-backref&quot;&gt;↩︎&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;li id=&quot;fn9&quot; class=&quot;footnote-item&quot;&gt;&lt;p&gt;&lt;a href=&quot;https://www.gov.uk/service-manual&quot;&gt;UK Government Service Manual&lt;/a&gt; &lt;a href=&quot;https://cioportfolio.github.io/2018/01/getting-shared-services-to-work/#fnref9&quot; class=&quot;footnote-backref&quot;&gt;↩︎&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ol&gt;&lt;/section&gt;"},{"id":"https://cioportfolio.github.io/2018/01/will-shared-services-ever-work/","url":"https://cioportfolio.github.io/2018/01/will-shared-services-ever-work/","title":"Will shared services ever work?","date_published":"2018-01-17T00:00:00Z","language":"","content_html":"&lt;p&gt;Last week the UK Government &lt;a href=&quot;https://twitter.com/MatthewCCoats1/status/951140210913443840&quot;&gt;launched a new strategy&lt;/a&gt; for shared business services (common things such as finance and human resources). The general reaction seemed to be quite negative, at least in my filter bubble.  Most of the criticisms are probably reasonable but that may be because there are so few examples of sharing successfully at this scale in other countries or sectors.&lt;/p&gt;&lt;p&gt;I am hoping to join a discussion about all this at &lt;a href=&quot;https://www.ukgovcamp.com/&quot;&gt;UKGovCamp&lt;/a&gt; at the weekend and some in Government are keen to hear what campers think.&lt;/p&gt;&lt;blockquote class=&quot;twitter-tweet&quot; data-lang=&quot;en&quot;&gt;&lt;p lang=&quot;en&quot; dir=&quot;ltr&quot;&gt;Now that would be really helpful. I can&amp;#39;t go but would be really grateful if you could raise this.&lt;/p&gt;&amp;mdash; Liam Maxwell (@liammax) &lt;a href=&quot;https://twitter.com/liammax/status/952497202181627904?ref_src=twsrc%5Etfw&quot;&gt;January 14, 2018&lt;/a&gt;&lt;/blockquote&gt;&lt;script async=&quot;&quot; src=&quot;https://platform.twitter.com/widgets.js&quot; charset=&quot;utf-8&quot;&gt;&lt;/script&gt;&lt;p&gt;In the meantime here are some potential challenges and responses to consider. Most of these are relevant for sharing business services in any sector.&lt;/p&gt;&lt;h2 id=&quot;economies-of-scale-have-limits&quot;&gt;Economies of scale have limits&lt;/h2&gt;&lt;p&gt;I have not seen the cost benefit analysis for this new strategy, if there is one, but I have worked on a few for shared business services and reviewed many more. Most have an implicit assumption that more sharing always produces benefits. Most cases recognise diminishing returns but it is very rare to consider negative returns (where marginal increases in cost exceed the marginal benefits). This must be a practical consideration at the scale of UK government.&lt;/p&gt;&lt;p&gt;The thresholds vary for different types of service (e.g. &lt;a href=&quot;https://cioportfolio.github.io/2012/07/how-to-organise-it-on-a-global-scale/&quot;&gt;I have written about this for IT in the past&lt;/a&gt;) but, as a rough guide, pooling services for organisations with a combined workforce of 10,000 - 25,000 people can generally be made to work and deliver an attractive benefits profile. At a smaller scale there will almost certainly be more valuable investment opportunities in your portfolio. At a larger scale the barriers get greater and greater and the net benefits may quickly evaporate.&lt;/p&gt;&lt;p&gt;Some large multinationals have rowed back from sharing business services across their whole organisation due to these issues. Some individual Departments in the UK are already at this scale even if they don’t share services with others.&lt;/p&gt;&lt;h2 id=&quot;shared-erp-software-has-very-little-value&quot;&gt;Shared ERP software has very little value&lt;/h2&gt;&lt;p&gt;I used to work for one of the big ERP vendors so I am one of the few people who have used a raw installation of one of these suites of software. Many people will be surprised that you can do almost nothing with the system at first. These suites only start to work when you feed them vast amounts of information including details about your customers, staff, suppliers, assets, accounting practices, roles, operating structure, business policies and working practices.This is a kind of digital twin of the operations your service will support.&lt;/p&gt;&lt;p&gt;The technology costs are usually dwarfed by the upfront costs of collecting, translating and testing this information and the on-going costs of maintaining it. The more ways of working a shared service needs to support the more information, and therefore cost, will be consumed. Adding a small organisation with distinct processes to a larger shared service can destroy the business case for both.&lt;/p&gt;&lt;h2 id=&quot;work-with-not-against-the-natural-limits-to-shared-business-services&quot;&gt;Work with, not against, the natural limits to shared business services&lt;/h2&gt;&lt;p&gt;In theory, it would be possible to mobilise a programme that could deliver cross-Government shared services but you would need to pick a truly exception team of people from a number of different Departments and suppliers. These people do exist but, unfortunately, they are already running operations and change programmes with much greater impact than back-office business services.&lt;/p&gt;&lt;p&gt;A more practical response would be to focus on capturing the large share of benefits available at a smaller scale. This would mean:&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Identifying several clusters of organisations at the 10,000 - 25,000 staff scale.&lt;/li&gt;&lt;li&gt;Appoint a business services director for each cluster.&lt;/li&gt;&lt;li&gt;Transfer the business service operations and funding to the director.&lt;/li&gt;&lt;li&gt;Set ambitious goals for improvements but allow the directors to take different approaches for their cluster.&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;This might not release all of the theoretical benefits of more substantial sharing but is at a scale that the teams involved can manage. It will take less than half of the 10 year strategy timetable offering the opportunity to go further if the evidence and capability is there. It will also allow alternative approaches to be compared in practice including using different technology and delivery methods.&lt;/p&gt;&lt;h2 id=&quot;watch-this-space&quot;&gt;Watch this space&lt;/h2&gt;&lt;p&gt;The &lt;a href=&quot;https://cioportfolio.github.io/2018/01/getting-shared-services-to-work/&quot;&gt;next blog post&lt;/a&gt; provides some feedback on the discussions at UKGovCamp.&lt;/p&gt;"}]}